{
  "workItems": [
    {
        "job_title": "Software Engineer",
        "company": "DoorDash",
        "location": "São Paulo, Brazil",
        "duration": "Nov. 2025",
        "image_url": "assets/doordash_work_item.png",
        "overview": "I’ve recently joined DoorDash, where I'll be working as a Backend Software Engineer, while contributing to the expansion of the company's new office in São Paulo, Brazil"
    },
    {
        "job_title": "Software Dev Engineer I",
        "company": "Amazon",
        "location": "São Paulo, Brazil",
        "duration": "(2 years, 2 months) Aug. 2023 - Nov. 2025",
        "image_url": "assets/amazon_work_item.jpg",
        "technologies": [
            {
                "text": "Java",
                "style": "PLAIN"
            },
            {
                "text": "Kotlin",
                "style": "PLAIN"
            },
            {
                "text": "Python",
                "style": "PLAIN"
            },
            {
                "text": "AWS",
                "style": "PLAIN"
            },
            {
                "text": "TypeScript",
                "style": "PLAIN"
            }
        ],
        "overview": "I’ve spent the last two years working as a Software Engineer at Amazon, where I focused on building integrations with government APIs to enable eInvoicing and ensure compliance with tax regulations across the many countries where Amazon operates. During this time, I led and contributed to several impactful projects:",
        "bullet_points": [
            "Project Lead – Spain eInvoice Integration: Led the end-to-end development of Amazon’s eInvoicing solution for Spain, managing a team of four SDEs. I was responsible for API and documentation scoping, prototyping, system design, implementation, testing, and launch readiness.",
            "Operational Excellence Champion: Took ownership of operational health, identifying and addressing the root causes behind our most frequent high-severity tickets. These efforts led to a ~40% reduction in monthly high-severity incidents.",
            "Load Testing and Performance Optimization: Designed and implemented load testing for our document submission platform, which handled the majority of our eInvoice traffic. This initiative helped uncover performance bottlenecks, increase system supported load, and improve deployment safety."
        ]
    },
    {
        "job_title": "Software Engineer Intern",
        "company": "Amazon",
        "location": "São Paulo, Brazil",
        "duration": "(1 years) Aug. 2022 - Jul. 2023",
        "image_url": "assets/amazon_intern_work_item.png",
        "technologies": [
            {
                "text": "Kotlin",
                "style": "PLAIN"
            },
            {
                "text": "AWS",
                "style": "PLAIN"
            },
            {
                "text": "TypeScript",
                "style": "PLAIN"
            }
        ],
        "overview": "I began my journey at Amazon as a Software Engineer Intern during my final year of university. Throughout this time, I was given hands-on challenging projects to work on, which gave me a solid understanding of what it was like to work as a full-time Software Development Engineer. My strong performance and high-quality work earned me a full-time offer upon graduation. Some of the key projects I worked on:",
        "bullet_points": [
            "3rd-Party API Monitoring System: Designed and built a monitoring solution using AWS that periodically checked the availability of third-party APIs. This acted as an early warning system, helping the team to quickly detect and respond to external API outages",
            "Turkish eInvoice Auto-Retry Mechanism: Designed and implemented a smart retry mechanism for Turkey’s eInvoice system, automatically handling transient failures based on historical error data. This reduced submission errors by 90% and significantly decreased operational burden"
        ]
    }
  ]
}