{
  "projectItems": [
    {
        "project_title": "CORAA Dataset Project",
        "technologies": [
            {
                "text": "Python",
                "style": "PILL"
            },
            {
                "text": "SQL",
                "style": "PILL"
            }
        ],
        "overview": "Worked as a research assistent at the CORAA Dataset Project, an research initiative product of a joint effort between University of São Paulo (USP) and Federal University of Technology of Paraná (UTFPR) that aimed to create a dataset proper for the training of portuguese speech recognition IAs. Its creation is of major importance, given that there are very few datasets of its kind available in portuguese\n\nMy contributions were to pre-process audio and text using Python and SQL to be incorporated into the dataset, as well as to generate statistical analysis about the collect data",
        "bullet_points": [
            "Published research article: “CORAA: a large corpus of spontaneous and prepared speech manually validated for speech recognition in Brazilian Portuguese”, Language Resources and Evaluation"
        ],
        "relevant_links": [
            {
                "text": "Published article",
                "url": "https://arxiv.org/abs/2110.15731"
            },
            {
                "text": "Developed python scripts",
                "url": "https://github.com/fergorgs/CORAA-scripts"
            }
        ]
    },
    {
        "project_title": "ProjectEDU",
        "technologies": [
            {
                "text": "React Native",
                "style": "PILL"
            },
            {
                "text": "JavaScript",
                "style": "PILL"
            }
        ],
        "overview": "Worked as a research assistent at the ProjectEDU research, which aimed to build a mobile learning app about Project Management. My contributions were the development of the front-end application, which would poll static content from a remote URL and display it on the screen, allowing for content update with the need for an application update at the user's phone",
        "bullet_points": [
            "Published research article: “An Analysis of ProjectEdu: A Mobile Learning Application for Software Project Management Education”"
        ],
        "relevant_links": [
            {
                "text": "Published article",
                "url": "https://link.springer.com/chapter/10.1007/978-3-030-21817-1_4"
            },
            {
                "text": "Project's github",
                "url": "https://github.com/fergorgs/ProjectEduApp"
            }
        ]
    },
    {
        "project_title": "Esportizando",
        "technologies": [
            {
                "text": "React Native",
                "style": "PILL"
            },
            {
                "text": "JavaScript",
                "style": "PILL"
            }
        ],
        "overview": "Developed the “Esportizando” mobile app for the 9th edition of the Campus Mobile competition, a nation wide contest from Brazil whose goal is to promote innovative solutions using mobile technology. Taking part in a team of three, our app’s goal was to encourage sports practice in the big cities by building a \"sport's social network\"",
        "bullet_points": [
            "Finished top 16 in the Smart Cities category"
        ],
        "relevant_links": [
            {
                "text": "Project's github",
                "url": "https://github.com/fergorgs/Esportizando"
            },
            {
                "text": "List of 16 finalist",
                "url": "https://www.institutoclaro.org.br/nossas-novidades/conheca-os-projetos-selecionados-para-participarem-da-9a-edicao-do-campus-mobile/"
            }
        ]
    }
  ]
}